//                                  string 类型
// let str = 'hello world'    
// // 字符串类型中 + 就是拼接
// let str2 =str + ' js'
// let str3 = `${str} js`
// console.log(str2)

// console.log(str.at(3))
// console.log(str.slice(0,7))


//字符串转换为数字
// let n =1
// let m = '2'
// let q = 'q'
// console.log(Number(n+m))     // 12
// console.log(n + Number(m))   // 3
// console.log(Number(q))       // NaN  无法表达的数字也是一种数字


//大到无法表达的数字
// 2**53，2的53次方是js的极限安全值,9007199254740992
// console.log(123123123123123123+1)



//-----------------------------------------------------------------------------------
//                                  number 类型
// let num = 123                 
// let num2 = num + 0.1 //js里所有数都是number，不分浮点型
// //如果要转换类型，例如转换为字符串
// console.log(num2.toString())
// //任何类型 + 字符串就会变成字符串
// console.log(num2 + '5')
//-----------------------------------------------------------------------------------
//                                   boolean 类型 布尔
// if(true){                        
//     console.log('lele')
// }
//-----------------------------------------------------------------------------------
//                                   undefined 类型
//
//当里面写的是数字的时候，会被v8转换为boolean类型
//只有 0 和 NaN 会被判定成 false
// if(1){
//     console.log('lele')
// }


//undefined 既是一个值也是一个类型
// let u = undefined + ''  //输出字符串 undefined

//-------------------------------------------------------------------------------------
//                                 null类型
//是一个空指针，代表一个不指向任何值的指针

//-------------------------------------------------------------------------------------
//                                 bigint类型   
// 来表示超过安全值的数字                   
//let b = 123123123n
let c = 9007199254740992n     
console.log(c)

//-------------------------------------------------------------------------------------
//                                 ==与===
// let a = 1
// let b = '1'
// //  ==判断时，会自动转换为数字进行比较
// console.log(a == b)    //true
// // ===全等判断时，必须完全一致才能输出true，不会自动转换
// console.log(a===b)     //false
//-------------------------------------------------------------------------------------
//                                 Symbol
let s = Symbol('hello')
let p = Symbol('hello')

console.log( s== p)       //false
// Symbol 全世界独一无二的值，完全相等也不会判断为相同的值

